src/ewswrapper/log/ews_debug.log

2013-11-29 10:09:53 DEBUG: sending to (https://KC-LN-VS23-EX1/EWS/Exchange.asmx)
message:
<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
   <s:Header>
      <t:RequestServerVersion Version="Exchange2007_SP1"/>
   </s:Header>
   <s:Body>
      <m:FindItem Traversal="Shallow">
         <m:ItemShape>
            <t:BaseShape>Default</t:BaseShape>
         </m:ItemShape>
         <m:ParentFolderIds>
            <t:DistinguishedFolderId Id="contacts">
               <t:Mailbox>
                  <t:EmailAddress>robert.betts@kewcapital.com</t:EmailAddress>
               </t:Mailbox>
            </t:DistinguishedFolderId>
         </m:ParentFolderIds>
      </m:FindItem>
   </s:Body>
</s:Envelope>
2013-11-29 10:09:53 DEBUG: headers = {'SOAPAction': u'"http://schemas.microsoft.com/exchange/services/2006/messages/FindItem"', 'Content-Type': 'text/xml; charset=utf-8'}
2013-11-29 10:09:54 DEBUG: http succeeded:
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Header><t:ServerVersionInfo MajorVersion="8" MinorVersion="3" MajorBuildNumber="83" MinorBuildNumber="4" Version="Exchange2007_SP1" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" /></soap:Header><soap:Body><m:FindItemResponse xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages"><m:ResponseMessages><m:FindItemResponseMessage ResponseClass="Success"><m:ResponseCode>NoError</m:ResponseCode><m:RootFolder TotalItemsInView="2" IncludesLastItemInRange="true"><t:Items><t:Contact><t:ItemId Id="AAMkADgyNWI5MDg0LTdjZGItNDc0Yy1hMTU3LTE3MWU5MzZkZTY2ZABGAAAAAAAUIQDG3LkrRaXPUm0OEmyJBwD6OqkplBaIQauzHvP6ydv/ABBDkmQaAAD6OqkplBaIQauzHvP6ydv/ABBDk0u5AAA=" ChangeKey="EQAAABYAAAD6OqkplBaIQauzHvP6ydv/ABBDk2wV" /><t:HasAttachments>false</t:HasAttachments><t:Culture>en-GB</t:Culture><t:FileAs>Betts, Billybob</t:FileAs><t:CompleteName><t:FirstName>Billybob</t:FirstName><t:LastName>Betts</t:LastName><t:Initials>B.B.</t:Initials><t:FullName>Billybob Betts</t:FullName></t:CompleteName><t:CompanyName /><t:EmailAddresses><t:Entry Key="EmailAddress1">betts_robert@yahoo.com</t:Entry><t:Entry Key="EmailAddress2">robert.betts@navohpartners.com</t:Entry><t:Entry Key="EmailAddress3" /></t:EmailAddresses><t:PhysicalAddresses><t:Entry Key="Business"><t:Street /><t:City /><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry><t:Entry Key="Home"><t:Street /><t:City /><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry><t:Entry Key="Other"><t:Street /><t:City /><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry></t:PhysicalAddresses><t:PhoneNumbers><t:Entry Key="AssistantPhone" /><t:Entry Key="BusinessPhone" /><t:Entry Key="BusinessPhone2" /><t:Entry Key="Callback" /><t:Entry Key="CarPhone" /><t:Entry Key="CompanyMainPhone" /><t:Entry Key="HomePhone" /><t:Entry Key="HomePhone2" /><t:Entry Key="Isdn" /><t:Entry Key="MobilePhone" /><t:Entry Key="OtherTelephone" /><t:Entry Key="Pager" /><t:Entry Key="PrimaryPhone" /><t:Entry Key="RadioPhone" /><t:Entry Key="Telex" /><t:Entry Key="TtyTddPhone" /></t:PhoneNumbers><t:ImAddresses><t:Entry Key="ImAddress1" /></t:ImAddresses><t:JobTitle /></t:Contact><t:Contact><t:ItemId Id="AAMkADgyNWI5MDg0LTdjZGItNDc0Yy1hMTU3LTE3MWU5MzZkZTY2ZABGAAAAAAAUIQDG3LkrRaXPUm0OEmyJBwD6OqkplBaIQauzHvP6ydv/ABBDkmQaAAD6OqkplBaIQauzHvP6ydv/ABBDk0u4AAA=" ChangeKey="EQAAABYAAAD6OqkplBaIQauzHvP6ydv/ABBDk1eV" /><t:HasAttachments>false</t:HasAttachments><t:Culture>en-GB</t:Culture><t:FileAs>Gillbert, Bill</t:FileAs><t:CompleteName><t:FirstName>Bill</t:FirstName><t:LastName>Gillbert</t:LastName><t:Initials>B.G.</t:Initials><t:FullName>Bill Gillbert</t:FullName></t:CompleteName><t:CompanyName>Navoh Partners</t:CompanyName><t:EmailAddresses><t:Entry Key="EmailAddress1">bill.gilbert@navohpartners.com</t:Entry><t:Entry Key="EmailAddress2" /><t:Entry Key="EmailAddress3" /></t:EmailAddresses><t:PhysicalAddresses><t:Entry Key="Business"><t:Street>The Hub Kings Cross</t:Street><t:City>London</t:City><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry><t:Entry Key="Home"><t:Street /><t:City /><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry><t:Entry Key="Other"><t:Street /><t:City /><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry></t:PhysicalAddresses><t:PhoneNumbers><t:Entry Key="AssistantPhone" /><t:Entry Key="BusinessPhone" /><t:Entry Key="BusinessPhone2" /><t:Entry Key="Callback" /><t:Entry Key="CarPhone" /><t:Entry Key="CompanyMainPhone" /><t:Entry Key="HomePhone" /><t:Entry Key="HomePhone2" /><t:Entry Key="Isdn" /><t:Entry Key="MobilePhone" /><t:Entry Key="OtherTelephone" /><t:Entry Key="Pager" /><t:Entry Key="PrimaryPhone" /><t:Entry Key="RadioPhone" /><t:Entry Key="Telex" /><t:Entry Key="TtyTddPhone" /></t:PhoneNumbers><t:ImAddresses><t:Entry Key="ImAddress1" /></t:ImAddresses><t:JobTitle /></t:Contact></t:Items></m:RootFolder></m:FindItemResponseMessage></m:ResponseMessages></m:FindItemResponse></soap:Body></soap:Envelope>
2013-11-29 10:13:11 DEBUG: sending to (https://KC-LN-VS23-EX1/EWS/Exchange.asmx)
message:
<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
   <s:Header>
      <t:RequestServerVersion Version="Exchange2007_SP1"/>
   </s:Header>
   <s:Body>
      <m:FindItem Traversal="Shallow">
         <m:ItemShape>
            <t:BaseShape>Default</t:BaseShape>
         </m:ItemShape>
         <m:ParentFolderIds>
            <t:DistinguishedFolderId Id="contacts">
               <t:Mailbox>
                  <t:EmailAddress>robert.betts@kewcapital.com</t:EmailAddress>
               </t:Mailbox>
            </t:DistinguishedFolderId>
         </m:ParentFolderIds>
      </m:FindItem>
   </s:Body>
</s:Envelope>
2013-11-29 10:13:11 DEBUG: headers = {'SOAPAction': u'"http://schemas.microsoft.com/exchange/services/2006/messages/FindItem"', 'Content-Type': 'text/xml; charset=utf-8'}
2013-11-29 10:13:12 DEBUG: http succeeded:
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Header><t:ServerVersionInfo MajorVersion="8" MinorVersion="3" MajorBuildNumber="83" MinorBuildNumber="4" Version="Exchange2007_SP1" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" /></soap:Header><soap:Body><m:FindItemResponse xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages"><m:ResponseMessages><m:FindItemResponseMessage ResponseClass="Success"><m:ResponseCode>NoError</m:ResponseCode><m:RootFolder TotalItemsInView="2" IncludesLastItemInRange="true"><t:Items><t:Contact><t:ItemId Id="AAMkADgyNWI5MDg0LTdjZGItNDc0Yy1hMTU3LTE3MWU5MzZkZTY2ZABGAAAAAAAUIQDG3LkrRaXPUm0OEmyJBwD6OqkplBaIQauzHvP6ydv/ABBDkmQaAAD6OqkplBaIQauzHvP6ydv/ABBDk0u5AAA=" ChangeKey="EQAAABYAAAD6OqkplBaIQauzHvP6ydv/ABBDk2wV" /><t:HasAttachments>false</t:HasAttachments><t:Culture>en-GB</t:Culture><t:FileAs>Betts, Billybob</t:FileAs><t:CompleteName><t:FirstName>Billybob</t:FirstName><t:LastName>Betts</t:LastName><t:Initials>B.B.</t:Initials><t:FullName>Billybob Betts</t:FullName></t:CompleteName><t:CompanyName /><t:EmailAddresses><t:Entry Key="EmailAddress1">betts_robert@yahoo.com</t:Entry><t:Entry Key="EmailAddress2">robert.betts@navohpartners.com</t:Entry><t:Entry Key="EmailAddress3" /></t:EmailAddresses><t:PhysicalAddresses><t:Entry Key="Business"><t:Street /><t:City /><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry><t:Entry Key="Home"><t:Street /><t:City /><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry><t:Entry Key="Other"><t:Street /><t:City /><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry></t:PhysicalAddresses><t:PhoneNumbers><t:Entry Key="AssistantPhone" /><t:Entry Key="BusinessPhone" /><t:Entry Key="BusinessPhone2" /><t:Entry Key="Callback" /><t:Entry Key="CarPhone" /><t:Entry Key="CompanyMainPhone" /><t:Entry Key="HomePhone" /><t:Entry Key="HomePhone2" /><t:Entry Key="Isdn" /><t:Entry Key="MobilePhone" /><t:Entry Key="OtherTelephone" /><t:Entry Key="Pager" /><t:Entry Key="PrimaryPhone" /><t:Entry Key="RadioPhone" /><t:Entry Key="Telex" /><t:Entry Key="TtyTddPhone" /></t:PhoneNumbers><t:ImAddresses><t:Entry Key="ImAddress1" /></t:ImAddresses><t:JobTitle /></t:Contact><t:Contact><t:ItemId Id="AAMkADgyNWI5MDg0LTdjZGItNDc0Yy1hMTU3LTE3MWU5MzZkZTY2ZABGAAAAAAAUIQDG3LkrRaXPUm0OEmyJBwD6OqkplBaIQauzHvP6ydv/ABBDkmQaAAD6OqkplBaIQauzHvP6ydv/ABBDk0u4AAA=" ChangeKey="EQAAABYAAAD6OqkplBaIQauzHvP6ydv/ABBDk1eV" /><t:HasAttachments>false</t:HasAttachments><t:Culture>en-GB</t:Culture><t:FileAs>Gillbert, Bill</t:FileAs><t:CompleteName><t:FirstName>Bill</t:FirstName><t:LastName>Gillbert</t:LastName><t:Initials>B.G.</t:Initials><t:FullName>Bill Gillbert</t:FullName></t:CompleteName><t:CompanyName>Navoh Partners</t:CompanyName><t:EmailAddresses><t:Entry Key="EmailAddress1">bill.gilbert@navohpartners.com</t:Entry><t:Entry Key="EmailAddress2" /><t:Entry Key="EmailAddress3" /></t:EmailAddresses><t:PhysicalAddresses><t:Entry Key="Business"><t:Street>The Hub Kings Cross</t:Street><t:City>London</t:City><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry><t:Entry Key="Home"><t:Street /><t:City /><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry><t:Entry Key="Other"><t:Street /><t:City /><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry></t:PhysicalAddresses><t:PhoneNumbers><t:Entry Key="AssistantPhone" /><t:Entry Key="BusinessPhone" /><t:Entry Key="BusinessPhone2" /><t:Entry Key="Callback" /><t:Entry Key="CarPhone" /><t:Entry Key="CompanyMainPhone" /><t:Entry Key="HomePhone" /><t:Entry Key="HomePhone2" /><t:Entry Key="Isdn" /><t:Entry Key="MobilePhone" /><t:Entry Key="OtherTelephone" /><t:Entry Key="Pager" /><t:Entry Key="PrimaryPhone" /><t:Entry Key="RadioPhone" /><t:Entry Key="Telex" /><t:Entry Key="TtyTddPhone" /></t:PhoneNumbers><t:ImAddresses><t:Entry Key="ImAddress1" /></t:ImAddresses><t:JobTitle /></t:Contact></t:Items></m:RootFolder></m:FindItemResponseMessage></m:ResponseMessages></m:FindItemResponse></soap:Body></soap:Envelope>
2013-11-29 10:14:10 DEBUG: sending to (https://KC-LN-VS23-EX1/EWS/Exchange.asmx)
message:
<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
   <s:Header>
      <t:RequestServerVersion Version="Exchange2007_SP1"/>
   </s:Header>
   <s:Body>
      <m:FindItem Traversal="Shallow">
         <m:ItemShape>
            <t:BaseShape>Default</t:BaseShape>
         </m:ItemShape>
         <m:ParentFolderIds>
            <t:DistinguishedFolderId Id="contacts">
               <t:Mailbox>
                  <t:EmailAddress>robert.betts@kewcapital.com</t:EmailAddress>
               </t:Mailbox>
            </t:DistinguishedFolderId>
         </m:ParentFolderIds>
      </m:FindItem>
   </s:Body>
</s:Envelope>
2013-11-29 10:14:10 DEBUG: headers = {'SOAPAction': u'"http://schemas.microsoft.com/exchange/services/2006/messages/FindItem"', 'Content-Type': 'text/xml; charset=utf-8'}
2013-11-29 10:14:11 DEBUG: http succeeded:
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Header><t:ServerVersionInfo MajorVersion="8" MinorVersion="3" MajorBuildNumber="83" MinorBuildNumber="4" Version="Exchange2007_SP1" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" /></soap:Header><soap:Body><m:FindItemResponse xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages"><m:ResponseMessages><m:FindItemResponseMessage ResponseClass="Success"><m:ResponseCode>NoError</m:ResponseCode><m:RootFolder TotalItemsInView="2" IncludesLastItemInRange="true"><t:Items><t:Contact><t:ItemId Id="AAMkADgyNWI5MDg0LTdjZGItNDc0Yy1hMTU3LTE3MWU5MzZkZTY2ZABGAAAAAAAUIQDG3LkrRaXPUm0OEmyJBwD6OqkplBaIQauzHvP6ydv/ABBDkmQaAAD6OqkplBaIQauzHvP6ydv/ABBDk0u5AAA=" ChangeKey="EQAAABYAAAD6OqkplBaIQauzHvP6ydv/ABBDk2wV" /><t:HasAttachments>false</t:HasAttachments><t:Culture>en-GB</t:Culture><t:FileAs>Betts, Billybob</t:FileAs><t:CompleteName><t:FirstName>Billybob</t:FirstName><t:LastName>Betts</t:LastName><t:Initials>B.B.</t:Initials><t:FullName>Billybob Betts</t:FullName></t:CompleteName><t:CompanyName /><t:EmailAddresses><t:Entry Key="EmailAddress1">betts_robert@yahoo.com</t:Entry><t:Entry Key="EmailAddress2">robert.betts@navohpartners.com</t:Entry><t:Entry Key="EmailAddress3" /></t:EmailAddresses><t:PhysicalAddresses><t:Entry Key="Business"><t:Street /><t:City /><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry><t:Entry Key="Home"><t:Street /><t:City /><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry><t:Entry Key="Other"><t:Street /><t:City /><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry></t:PhysicalAddresses><t:PhoneNumbers><t:Entry Key="AssistantPhone" /><t:Entry Key="BusinessPhone" /><t:Entry Key="BusinessPhone2" /><t:Entry Key="Callback" /><t:Entry Key="CarPhone" /><t:Entry Key="CompanyMainPhone" /><t:Entry Key="HomePhone" /><t:Entry Key="HomePhone2" /><t:Entry Key="Isdn" /><t:Entry Key="MobilePhone" /><t:Entry Key="OtherTelephone" /><t:Entry Key="Pager" /><t:Entry Key="PrimaryPhone" /><t:Entry Key="RadioPhone" /><t:Entry Key="Telex" /><t:Entry Key="TtyTddPhone" /></t:PhoneNumbers><t:ImAddresses><t:Entry Key="ImAddress1" /></t:ImAddresses><t:JobTitle /></t:Contact><t:Contact><t:ItemId Id="AAMkADgyNWI5MDg0LTdjZGItNDc0Yy1hMTU3LTE3MWU5MzZkZTY2ZABGAAAAAAAUIQDG3LkrRaXPUm0OEmyJBwD6OqkplBaIQauzHvP6ydv/ABBDkmQaAAD6OqkplBaIQauzHvP6ydv/ABBDk0u4AAA=" ChangeKey="EQAAABYAAAD6OqkplBaIQauzHvP6ydv/ABBDk1eV" /><t:HasAttachments>false</t:HasAttachments><t:Culture>en-GB</t:Culture><t:FileAs>Gillbert, Bill</t:FileAs><t:CompleteName><t:FirstName>Bill</t:FirstName><t:LastName>Gillbert</t:LastName><t:Initials>B.G.</t:Initials><t:FullName>Bill Gillbert</t:FullName></t:CompleteName><t:CompanyName>Navoh Partners</t:CompanyName><t:EmailAddresses><t:Entry Key="EmailAddress1">bill.gilbert@navohpartners.com</t:Entry><t:Entry Key="EmailAddress2" /><t:Entry Key="EmailAddress3" /></t:EmailAddresses><t:PhysicalAddresses><t:Entry Key="Business"><t:Street>The Hub Kings Cross</t:Street><t:City>London</t:City><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry><t:Entry Key="Home"><t:Street /><t:City /><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry><t:Entry Key="Other"><t:Street /><t:City /><t:State /><t:CountryOrRegion /><t:PostalCode /></t:Entry></t:PhysicalAddresses><t:PhoneNumbers><t:Entry Key="AssistantPhone" /><t:Entry Key="BusinessPhone" /><t:Entry Key="BusinessPhone2" /><t:Entry Key="Callback" /><t:Entry Key="CarPhone" /><t:Entry Key="CompanyMainPhone" /><t:Entry Key="HomePhone" /><t:Entry Key="HomePhone2" /><t:Entry Key="Isdn" /><t:Entry Key="MobilePhone" /><t:Entry Key="OtherTelephone" /><t:Entry Key="Pager" /><t:Entry Key="PrimaryPhone" /><t:Entry Key="RadioPhone" /><t:Entry Key="Telex" /><t:Entry Key="TtyTddPhone" /></t:PhoneNumbers><t:ImAddresses><t:Entry Key="ImAddress1" /></t:ImAddresses><t:JobTitle /></t:Contact></t:Items></m:RootFolder></m:FindItemResponseMessage></m:ResponseMessages></m:FindItemResponse></soap:Body></soap:Envelope>
